results/k6-sprint-2-cache-output-initial.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /workspace/k6/sprint-2-cache.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/1m10.0s

running (0m02.0s), 02/20 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 02/20 VUs  0m02.0s/1m10.0s

running (0m03.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 02/20 VUs  0m03.0s/1m10.0s

running (0m04.0s), 03/20 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 03/20 VUs  0m04.0s/1m10.0s

running (0m05.0s), 04/20 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 04/20 VUs  0m05.0s/1m10.0s

running (0m06.0s), 04/20 VUs, 9 complete and 0 interrupted iterations
default   [   9% ] 04/20 VUs  0m06.0s/1m10.0s

running (0m07.0s), 05/20 VUs, 13 complete and 0 interrupted iterations
default   [  10% ] 05/20 VUs  0m07.0s/1m10.0s

running (0m08.0s), 06/20 VUs, 17 complete and 0 interrupted iterations
default   [  11% ] 06/20 VUs  0m08.0s/1m10.0s

running (0m09.0s), 06/20 VUs, 21 complete and 0 interrupted iterations
default   [  13% ] 06/20 VUs  0m09.0s/1m10.0s

running (0m10.0s), 07/20 VUs, 25 complete and 0 interrupted iterations
default   [  14% ] 07/20 VUs  0m10.0s/1m10.0s

running (0m11.0s), 07/20 VUs, 31 complete and 0 interrupted iterations
default   [  16% ] 07/20 VUs  0m11.0s/1m10.0s

running (0m12.0s), 08/20 VUs, 36 complete and 0 interrupted iterations
default   [  17% ] 08/20 VUs  0m12.0s/1m10.0s

running (0m13.0s), 09/20 VUs, 42 complete and 0 interrupted iterations
default   [  19% ] 09/20 VUs  0m13.0s/1m10.0s

running (0m14.0s), 09/20 VUs, 50 complete and 0 interrupted iterations
default   [  20% ] 09/20 VUs  0m14.0s/1m10.0s

running (0m15.0s), 10/20 VUs, 57 complete and 0 interrupted iterations
default   [  21% ] 10/20 VUs  0m15.0s/1m10.0s

running (0m16.0s), 11/20 VUs, 65 complete and 0 interrupted iterations
default   [  23% ] 11/20 VUs  0m16.0s/1m10.0s

running (0m17.0s), 11/20 VUs, 73 complete and 0 interrupted iterations
default   [  24% ] 11/20 VUs  0m17.0s/1m10.0s

running (0m18.0s), 12/20 VUs, 81 complete and 0 interrupted iterations
default   [  26% ] 12/20 VUs  0m18.0s/1m10.0s

running (0m19.0s), 13/20 VUs, 90 complete and 0 interrupted iterations
default   [  27% ] 13/20 VUs  0m19.0s/1m10.0s

running (0m20.0s), 13/20 VUs, 101 complete and 0 interrupted iterations
default   [  29% ] 13/20 VUs  0m20.0s/1m10.0s

running (0m21.0s), 14/20 VUs, 112 complete and 0 interrupted iterations
default   [  30% ] 14/20 VUs  0m21.0s/1m10.0s

running (0m22.0s), 14/20 VUs, 123 complete and 0 interrupted iterations
default   [  31% ] 14/20 VUs  0m22.0s/1m10.0s

running (0m23.0s), 15/20 VUs, 133 complete and 0 interrupted iterations
default   [  33% ] 15/20 VUs  0m23.0s/1m10.0s

running (0m24.0s), 16/20 VUs, 144 complete and 0 interrupted iterations
default   [  34% ] 16/20 VUs  0m24.0s/1m10.0s

running (0m25.0s), 16/20 VUs, 158 complete and 0 interrupted iterations
default   [  36% ] 16/20 VUs  0m25.0s/1m10.0s

running (0m26.0s), 17/20 VUs, 170 complete and 0 interrupted iterations
default   [  37% ] 17/20 VUs  0m26.0s/1m10.0s

running (0m27.0s), 18/20 VUs, 184 complete and 0 interrupted iterations
default   [  39% ] 18/20 VUs  0m27.0s/1m10.0s

running (0m28.0s), 18/20 VUs, 198 complete and 0 interrupted iterations
default   [  40% ] 18/20 VUs  0m28.0s/1m10.0s

running (0m29.0s), 19/20 VUs, 211 complete and 0 interrupted iterations
default   [  41% ] 19/20 VUs  0m29.0s/1m10.0s

running (0m30.0s), 19/20 VUs, 226 complete and 0 interrupted iterations
default   [  43% ] 19/20 VUs  0m30.0s/1m10.0s

running (0m31.0s), 20/20 VUs, 241 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  0m31.0s/1m10.0s

running (0m32.0s), 20/20 VUs, 257 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  0m32.0s/1m10.0s

running (0m33.0s), 20/20 VUs, 272 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  0m33.0s/1m10.0s

running (0m34.0s), 20/20 VUs, 289 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  0m34.0s/1m10.0s

running (0m35.0s), 20/20 VUs, 305 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  0m35.0s/1m10.0s

running (0m36.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  0m36.0s/1m10.0s

running (0m37.0s), 20/20 VUs, 335 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  0m37.0s/1m10.0s

running (0m38.0s), 20/20 VUs, 350 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  0m38.0s/1m10.0s

running (0m39.0s), 20/20 VUs, 368 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  0m39.0s/1m10.0s

running (0m40.0s), 20/20 VUs, 384 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  0m40.0s/1m10.0s

running (0m41.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  0m41.0s/1m10.0s

running (0m42.0s), 20/20 VUs, 415 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  0m42.0s/1m10.0s

running (0m43.0s), 20/20 VUs, 430 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  0m43.0s/1m10.0s

running (0m44.0s), 20/20 VUs, 446 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  0m44.0s/1m10.0s

running (0m45.0s), 20/20 VUs, 461 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  0m45.0s/1m10.0s

running (0m46.0s), 20/20 VUs, 477 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  0m46.0s/1m10.0s

running (0m47.0s), 20/20 VUs, 492 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  0m47.0s/1m10.0s

running (0m48.0s), 20/20 VUs, 509 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  0m48.0s/1m10.0s

running (0m49.0s), 20/20 VUs, 525 complete and 0 interrupted iterations
default   [  70% ] 20/20 VUs  0m49.0s/1m10.0s

running (0m50.0s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  0m50.0s/1m10.0s

running (0m51.0s), 20/20 VUs, 557 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  0m51.0s/1m10.0s

running (0m52.0s), 20/20 VUs, 572 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  0m52.0s/1m10.0s

running (0m53.0s), 20/20 VUs, 588 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  0m53.0s/1m10.0s

running (0m54.0s), 20/20 VUs, 604 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  0m54.0s/1m10.0s

running (0m55.0s), 20/20 VUs, 620 complete and 0 interrupted iterations
default   [  79% ] 20/20 VUs  0m55.0s/1m10.0s

running (0m56.0s), 20/20 VUs, 635 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  0m56.0s/1m10.0s

running (0m57.0s), 20/20 VUs, 650 complete and 0 interrupted iterations
default   [  81% ] 20/20 VUs  0m57.0s/1m10.0s

running (0m58.0s), 20/20 VUs, 667 complete and 0 interrupted iterations
default   [  83% ] 20/20 VUs  0m58.0s/1m10.0s

running (0m59.0s), 20/20 VUs, 681 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  0m59.0s/1m10.0s

running (1m00.0s), 20/20 VUs, 697 complete and 0 interrupted iterations
default   [  86% ] 20/20 VUs  1m00.0s/1m10.0s

running (1m01.0s), 20/20 VUs, 714 complete and 0 interrupted iterations
default   [  87% ] 20/20 VUs  1m01.0s/1m10.0s

running (1m02.0s), 18/20 VUs, 730 complete and 0 interrupted iterations
default   [  89% ] 18/20 VUs  1m02.0s/1m10.0s

running (1m03.0s), 16/20 VUs, 744 complete and 0 interrupted iterations
default   [  90% ] 16/20 VUs  1m03.0s/1m10.0s

running (1m04.0s), 14/20 VUs, 756 complete and 0 interrupted iterations
default   [  91% ] 14/20 VUs  1m04.0s/1m10.0s

running (1m05.0s), 12/20 VUs, 767 complete and 0 interrupted iterations
default   [  93% ] 12/20 VUs  1m05.0s/1m10.0s

running (1m06.0s), 10/20 VUs, 776 complete and 0 interrupted iterations
default   [  94% ] 10/20 VUs  1m06.0s/1m10.0s

running (1m07.0s), 07/20 VUs, 785 complete and 0 interrupted iterations
default   [  96% ] 07/20 VUs  1m07.0s/1m10.0s

running (1m08.0s), 05/20 VUs, 792 complete and 0 interrupted iterations
default   [  97% ] 05/20 VUs  1m08.0s/1m10.0s

running (1m09.0s), 04/20 VUs, 796 complete and 0 interrupted iterations
default   [  99% ] 04/20 VUs  1m09.0s/1m10.0s

running (1m10.0s), 02/20 VUs, 799 complete and 0 interrupted iterations
default   [ 100% ] 02/20 VUs  1m10.0s/1m10.0s

running (1m11.0s), 01/20 VUs, 800 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/20 VUs  1m10s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=270.74ms


  █ TOTAL RESULTS 

    checks_total.......: 3204    45.017286/s
    checks_succeeded...: 100.00% 3204 out of 3204
    checks_failed......: 0.00%   0 out of 3204

    ✓ status is 200
    ✓ response time < 500ms

    CUSTOM
    errors.........................: 0.00%  0 out of 801

    HTTP
    http_req_duration..............: avg=134.21ms min=1.33ms med=133.93ms max=294.27ms p(90)=266.96ms p(95)=270.74ms
      { expected_response:true }...: avg=134.21ms min=1.33ms med=133.93ms max=294.27ms p(90)=266.96ms p(95)=270.74ms
    http_req_failed................: 0.00%  0 out of 1602
    http_reqs......................: 1602   22.508643/s

    EXECUTION
    iteration_duration.............: avg=1.27s    min=1.26s  med=1.26s    max=1.29s    p(90)=1.27s    p(95)=1.28s   
    iterations.....................: 801    11.254321/s
    vus............................: 1      min=1         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 828 kB 12 kB/s
    data_sent......................: 365 kB 5.1 kB/s



running (1m11.2s), 00/20 VUs, 801 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  1m10s